Revit 2027 API
PartMaker.SetSourceElementIds Method
 Set the source elements for the PartMaker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSourceElementIds(
	ICollection<ElementId> sourceElementIds
)
Public Sub SetSourceElementIds (
	sourceElementIds As ICollection(Of ElementId)
)
public:
void SetSourceElementIds(
	ICollection<ElementId^>^ sourceElementIds
)
member SetSourceElementIds :
        sourceElementIds : ICollection<ElementId> -> unit
Parameters
sourceElementIds ICollection<ElementId>
 Elements to be the sources for this PartMaker.
Exceptions
Exception | Condition
ArgumentException |  One or more element ids was not permitted to be a source for this PartMaker Elements should be Parts that have no PartMaker yet
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartMaker Class
Autodesk.Revit.DB Namespace